<div class="title_container"><div class="page_title">Documentation Perl version [% perl_version %]</div></div>
    <h2>Contenu</h2>
    <p class="indent1">
      <b>fr.perldoc.org</b> contient la documentation de Perl version [% perl_version %], aux formats HTML et PDF.
    </p>
    <p class="indent1">
      Pour voir les nouveaut&eacute;s de Perl [% perl_version %], lire la page de manuel <a href="perldelta.html">perldelta</a>.
    </p>
    <p class="indent1">
      Si vous d&eacute;butez en Perl, vous devriez commencer par la lecture de la page de manuel <a href="perlintro.html">perlintro</a> qui est une introduction g&eacute;n&eacute;rale destin&eacute;e aux d&eacute;butants et qui fournit les &eacute;l&eacute;ments n&eacute;cessaires &agrave; une bonne navigation dans la documentation compl&egrave;te de Perl. La <a href="index-faq.html">FAQ</a> vous fournira aussi des r&eacute;ponses &agrave; plus de 300 questions fr&eacute;quemment pos&eacute;es.
    </p>

    <h2>Fonctionnalit&eacute;s du site</h2>
    <h3 class="italic">Recherche rapide des pages</h3>
    <p class="indent">
    Pour une navigation ais&eacute;e, saisissez n'importe quelle fonction Perl, page de manuel ou nom de module dans le champ de recherche pour aller directement &agrave; la section appropri&eacute;e (les r&eacute;sultats de la recherche seront aussi disponible).
    </p>
    
    <h3 class="italic">Coloration syntaxiques et liens dans les exemples</h3>
    <p class="indent">
    La documentation Perl contient des milliers d'exemples de code Perl. Ces exemples sont color&eacute;s syntaxiquement, et les fonctions / noms de module ont des liens vers leur documentation respective. Par exemple :
    <pre class="indent">#! /usr/bin/perl

<a class="l_k" href="functions/use.html">use</a> <a class="l_w" href="strict.html">strict</a><span class="sc">;</span>
<a class="l_k" href="functions/use.html">use</a> <a class="l_w" href="warnings.html">warnings</a><span class="sc">;</span>

<a class="l_k" href="functions/my.html">my</a> <span class="i">$greeting</span> = <span class="q">&quot;Hello, World!&quot;</span><span class
="sc">;</span>
<a class="l_k" href="functions/print.html">print</a> <span class="i">$greeting</span><span class="cm">,</span><span class="q">&quot;\n&quot;</sp
an><span class="sc">;</span>  <span class="c"># Say hello</span></pre>
    </span></p>
    </p>
  
    <h3 class="italic">Etiquettes</h3>
    <p class="indent">
    Chaque page ou recherche sur ce site peut &ecirc;tre &eacute;tiquett&eacute;e en s&eacute;lectionnant le lien <i>"Ajouter cette page"</i> dans la barre d'outils en haut &agrave; droite de la page.
    </p>
    
    <p class="indent">
    Ajuter une &eacute;tiquette cr&eacute;e un lien dynamique vers le document dans la section <i>Etiquettes</i> de la barre d'outils, permettant d'acc&eacute;der aux pages fr&eacute;quemment visit&eacute;es en un seul clic depuis n'importe o&ugrave; dans le site.
    </p>
    
    <h3 class="italic">Affichage personnalisable</h3>
    <p class="indent">
    La barre d'outils et le menu de navigation peuvent &ecirc;tre cach&eacute;s en cliquant sur l'icone fermer (<img src="close_blue.gif">) correspondante en haut de la page.
    </p>
    
    <p class="indent">
    Les pr&eacute;f&eacute;rences d'affichage et les d&eacute;tails des &eacute;tiquettes sont stock&eacute;s dans un cookie sur votre navigateur, ils seront donc pr&eacute;serv&eacute;s quand vous visiterez ce site depuis le m&ecirc;me ordinateur.
    </p>
    
    <a name="download"></a>
    <h2>T&eacute;l&eacute;chargements</h2>
    <p class="indent1">
      La documentation compl&egrave;te est t&eacute;l&eacute;chargeable pour un usage hors connexion.
      
    </p>
    <h3 class="italic">Version compl&egrave;te - contient les fichiers HTML et PDF</h3>
    <p class="indent">
    <a href="perldoc.tar.gz">http://perldoc.perl.org/perldoc.tar.gz</a> (24Mb).
    </p>
    <h3 class="italic">Version all&eacute;g&eacute;e - contient les fichiers HTML seulement</h3>
    <p class="indent">
    <a href="perldoc-html.tar.gz">http://perldoc.perl.org/perldoc-html.tar.gz</a> (3Mb).
    </p>
    <p class="indent1">
      De m&ecirc;me que les pages de documentation, l'outil de recherche perldoc est aussi inclu dans les t&eacute;l&eacute;chargements ci-dessus. Aucune installation n'est requise, il suffit de d&eacute;compresser l'archive et d'ouvirer le fichier <i>index.html</i> dans votre navigateur web.
    </p>
    <p class="indent1">
      Pour t&eacute;l&eacute;charger Perl, veuillez aller &agrave; <a href="http://www.perl.org/get.html">http://www.perl.org/get.html</a>.
    </p>
    &nbsp;
